#include <iostream>

//У пам'яті заданий масив з 8 елементів. Помістити в регістр EAX максимальний елемент масиву,
//а в регістр ESI його адресу в пам'яті.

int main()
{
    long X[8] = { 10, 2, 2, 54, 0, 34, 6, 100 };
    _asm
    {//початок ассемблерной вставки
        lea EBX, X              // початкова адреса масиву - в ЕВХ
        mov ECX, 7              // лічильник повторень
        mov EAX, dword ptr [EBX]// перший елемент - в Еах      
        m2: add	EBX, 4          // збільшення адреси
        cmp	EAX, dword ptr[EBX] // порівняння з наступним елементом
        jnc m1                  // перехід, якщо більше
        mov	EAX, dword ptr[EBX] // більший елемент - в Еах
        mov	ESI, EBX            // адреса елемента - в ESI
        m1: loop m2             // зациклення по лічильнику
    }
    return 0;
}
